SurfaceForegroundPatternId Property
 The id of the FillPatternElement used as the foreground pattern of faces with this material in normal views.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019
Syntax
C#
public ElementId SurfaceForegroundPatternId { get; set; }
Visual Basic
Public Property SurfaceForegroundPatternId As ElementId
	Get
	Set
Visual C++
public:
property ElementId^ SurfaceForegroundPatternId {
	ElementId^ get ();
	void set (ElementId^ value);
}
Remarks
 The FillPattern used for a surface foreground pattern can have a 'Drafting' or a 'Model' target.
Exceptions
Exception | Condition
Autodesk.Revit.ExceptionsArgumentException |  When setting this property: The element id must represent a valid FillPatternElement.
Autodesk.Revit.ExceptionsArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Material Class
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →